{ "id": 2, "elements": [ { "id": 1, "minScore": 26, "maxScore": 30, "text": "Ваши исключительные усилия и решения привели к открытию портала в новый мир. Вы становитесь легендарным героем, о ком слагают песни. Ваши открытия изменяют ход истории, и вы продолжаете свои приключения в неизвестных мирах, став символом отваги и знаний." }, { "id": 2, "minScore": 21, "maxScore": 26, "text": "Вы раскрываете большинство тайн, накопленных знаний хватает для раскрытия многих тайн меча и руны. Вы становитесь великим исследователем, уважаемым в академических кругах. Ваше имя вписывается в историю как одного из величайших знатоков древних тайн." }, { "id": 3, "minScore": 17, "maxScore": 21, "text": "Ваши усилия приводят к значительным открытиям, но некоторые тайны остаются за пределами вашего понимания. Вы становитесь хранителем секретов, продолжая работу над разгадыванием оставшихся загадок и защищая знания от недобросовестных искателей." }, { "id": 4, "minScore": 13, "maxScore": 17, "text": "Вы покидаете башню с богатым опытом и новыми знаниями. Хотя полностью раскрыть тайну не удалось, вы обогащены приключением и готовы к новым исследованиям. Ваши путешествия продолжаются, и вы уверены, что однажды вернетесь к неразгаданной загадке." }, { "id": 5, "minScore": 11, "maxScore": 13, "text": "Вы не смогли полностью раскрыть тайны, но ваше приключение пробуждает в вас жажду новых открытий. Вы отправляетесь в новые путешествия, исследуя другие миры и культуры, и накапливая знания для будущих вызовов." }, { "id": 6, "minScore": 9, "maxScore": 11, "text": "Опыт в башне оставил в вас чувство неудовлетворенности. Вы понимаете, что могли бы сделать больше, но неуверенность и сомнения помешали вам. Однако это становится толчком для личного развития и поиска новых путей в будущем." }, { "id": 7, "minScore": 0, "maxScore": 9, "text": "Вы покидаете башню, осознав, что пока не готовы к таким вызовам. Это приключение стало для вас уроком самопознания и понимания собственных ограничений. Вы решаете взять перерыв в приключениях, чтобы найти свой путь и обрести уверенность в своих силах." } ] }